app/Controllers/BarangKeluarController.php

SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $data['keluar'] = $this->barangKeluar
            ->select('barang_keluar.*, barang.nama_barang')
            ->join('barang', 'barang.id_barang = barang_keluar.id_barang')
            ->orderBy('tanggal', 'DESC')
            ->findAll();

SELECT *
FROM `barang`
---
    public function create()
    {
        $data['barang'] = $this->barang->findAll();

INSERT INTO `barang_keluar` (`id_barang`, `id_user`, `jumlah`, `tanggal`, `created_at`, `updated_at`) VALUES ('1', '1', '5', '2025-12-10 14:46:48', '2025-12-10 14:46:48', '2025-12-10 14:46:48')
---
    public function store()
    {
        try {
            $idUser = session()->get('id_user');

            $this->barangKeluar->insert([
                'id_barang' => $this->request->getPost('id_barang'),
                'id_user'   => $idUser,
                'jumlah'    => $this->request->getPost('jumlah'),
                'tanggal'   => date('Y-m-d H:i:s'),
            ]);

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '1'
UPDATE `barang` SET `stok` = 25, `updated_at` = '2025-12-10 03:47:38'
WHERE `barang`.`id_barang` IN ('1')
---
public function delete($id)
{
    $model = $this->barangKeluar;
    $barangModel = $this->barang;
    $data = $model->find($id);

    if (!$data) {
        session()->setFlashdata('error', 'Data tidak ditemukan!');
        return redirect()->back();
    }

    $idBarang = $data['id_barang'];
    $jumlahKeluar = $data['jumlah'];

    // Tambahkan kembali stok barang
    $barang = $barangModel->find($idBarang);
    $stokBaru = $barang['stok'] + $jumlahKeluar;

    $barangModel->update($idBarang, ['stok' => $stokBaru]);