app/Controllers/BarangMasukController.php

SELECT `barang_masuk`.*, `barang`.`nama_barang`, `user`.`username` AS `username`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id_barang` = `barang_masuk`.`id_barang`
LEFT JOIN `user` ON `user`.`id_user` = `barang_masuk`.`id_user`
ORDER BY `tanggal` DESC
SELECT *
FROM `barang`
---
    public function index()
    {
        $data['masuk'] = $this->barangMasuk
            ->select('barang_masuk.*, barang.nama_barang, user.username AS username')
            ->join('barang', 'barang.id_barang = barang_masuk.id_barang')
             ->join('user', 'user.id_user = barang_masuk.id_user', 'left')
            ->orderBy('tanggal', 'DESC')
            ->findAll();

        $data['barang'] = $this->barang->findAll();

SELECT *
FROM `barang`
---
    public function create()
    {
        $data['barang'] = $this->barang->findAll();

INSERT INTO `barang_masuk` (`id_barang`, `id_user`, `jumlah`, `tanggal`, `created_at`, `updated_at`) VALUES ('1', '1', '10', '2025-12-10 14:47:30', '2025-12-10 14:47:30', '2025-12-10 14:47:30')
---
    public function store()
    {
        $idUser = session()->get('id_user');

        $this->barangMasuk->insert([
            'id_barang' => $this->request->getPost('id_barang'),
            'id_user'   => $idUser,
            'jumlah'    => $this->request->getPost('jumlah'),
            'tanggal'   => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '1'
UPDATE `barang` SET `stok` = 25, `updated_at` = '2025-12-10 14:46:33'
WHERE `barang`.`id_barang` IN ('1')
---
public function delete($id)
{
    $model = $this->barangMasuk;
    $barangModel = $this->barang;
    $data = $model->find($id);

    if (!$data) {
        session()->setFlashdata('error', 'Data tidak ditemukan!');
        return redirect()->back();
    }

    $idBarang = $data['id_barang'];
    $jumlahMasuk = $data['jumlah'];

    $barang = $barangModel->find($idBarang);
    $stokBaru = $barang['stok'] - $jumlahMasuk;

    $barangModel->update($idBarang, ['stok' => $stokBaru]);